'use strict';

(function () {
  var PHOTOS_AMOUNT = 25;

  var DESCRIPTIONS_ARRAY = [
    'иберийский ирис',
    'ивановские иглы',
    'ивовый ил',
    'иглобрюх',
    'игрушечный инопланетянин',
    'Интересный инструмент',
    'Идеальный игрок',
    'Индивидуальный итог',
    'идиоматический индюк'
  ];

  var MESSAGES_ARRAY = ['Всё отлично!',
    'В целом всё неплохо. Но не всё.',
    'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
    'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
    'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
    'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
  ];

  var NAMES_ARRAY = ['Иван', 'Ирина', 'Игорь', 'Инга', 'Илларион', 'Инна', 'Ингрид'];

  window.data = {
    PHOTOS_AMOUNT: PHOTOS_AMOUNT,
    DESCRIPTIONS_ARRAY: DESCRIPTIONS_ARRAY,
    MESSAGES_ARRAY: MESSAGES_ARRAY,
    NAMES_ARRAY: NAMES_ARRAY
  };
})();
